<!DOCTYPE html>
<html lang="fr-fr">

<head>
    <meta charset="UTF-8">
    <meta name="author" content="Benjamin I. Clément T.S.">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="stylesheet" href="assets/css/style-nav.css">
    <link rel="stylesheet" href="assets/css/style-modeles.css">
    <link rel="stylesheet" href="assets/css/style-footer.css">
    <link rel="icon" type="image/x-icon" href="assets/imgs/logo.png">
    <title>Modèles | Raspberry Pi</title>
</head>
<body>
    <nav>
        <div>
                <img src="assets/imgs/logo.png" alt="img rasps" class="logo-rasp">
                <h2>SNT</h2>
    
                <div id="menu">
                <div>
                    <span class="span_1"></span>
                    <span class="span_2"></span>
                    <span class="span_3"></span>
                </div>
            </div>

        </div>

        <div style="display: flex;justify-content: space-between;width: 100%;"></div>

        <a id="a_Nav1">
            <li onclick="window.location.href='index.html'">Accueil</li>
        </a>
        <a id="a_Nav2">
            <li onclick="window.location.href='modeles.html'">Mod&egrave;les</li>
        </a>
        <a id="a_Nav3">
            <li onclick="window.location.href='projets.html'">Projets</li>
        </a>
    </nav>

    <div class="hero-container">
        <h2 class="h2-presentation">Voici les modèles de Raspberry Pi les plus utilisés, classé du plus récent au plus ancien.</h2>
    </div>

    <div class="container_card">
        <div class="card">
            <img src="assets/imgs/modeles_rasp/Raspberry-Pi-5.png" alt="" class="card_img">
            <div class="card_txt">
                <h3>Raspberry Pi mod&egrave;le 5</h3>
                <p>Le 28 septembre 2023, le Raspberry Pi 5 est annonc&eacute; et disponible en pr&eacute;commande. Il poss&egrave;de une interface PCIe 2.0 et est d&eacute;crit comme &eacute;tant deux à trois fois plus puissant que ses pr&eacute;d&eacute;cesseurs. Il devrait être disponible à partir de fin octobre.</p>
            </div>
        </div>
        <div class="card">
            <img src="assets/imgs/modeles_rasp/Raspberry-Pi-pico.png" alt="" class="card_img">
            <div class="card_txt">
                <h3>Raspberry Pi mod&egrave;le Pico</h3>
                <p>Le 21 janvier 2021, la fondation sort le Pico, sa premi&egrave;re carte microcontrôleur. À la diff&eacute;rence des autres produits de la fondation, celui-ci ne permet pas de faire tourner une distribution Linux, mais se rapproche plus d'une carte Arduino. Comme lors de la sortie du Raspberry pi 0, le num&eacute;ro du magazine Hackspace sorti au même moment est vendu accompagn&eacute; de la carte.</p>
            </div>
        </div>
        <div class="card">
            <img src="assets/imgs/modeles_rasp/Raspberry-Pi-zero.png" alt="" class="card_img">
            <div class="card_txt">
                <h3>Raspberry Pi mod&egrave;le Zero</h3>
                <p>Le 26 novembre 2015, la fondation Raspberry Pi annonce la sortie du Raspberry Pi Zero. Il reprend les sp&eacute;cifications du mod&egrave;le A/B avec un processeur cadenc&eacute; à 1 GHz au lieu de 700 MHz, il est par contre plus petit, disposant d'une connectique minimale. Son prix de 5 $ US est largement revu à la baisse par rapport aux autres Raspberry Pi.</p>
            </div>
        </div>
        <div class="card">
            <img src="assets/imgs/modeles_rasp/Raspberry-Pi-4B.png" alt="" class="card_img">
            <div class="card_txt">
                <h3>Raspberry Pi mod&egrave;le 4B</h3>
                <p>Le 28 mai 2020 est annonc&eacute;e une version à 8 Go de RAM74. Bien que Raspbian ne soit que 32 bits, les 8 Go peuvent être exploit&eacute;s via des processus ind&eacute;pendants lanc&eacute;s sous ce syst&egrave;me. Une version 64 bits est annonc&eacute;e, elle aussi branche de Debian, qui ne se nommera plus Raspbian, mais Raspberry Pi OS pour &eacute;viter les confusions, et identique en interface.</p>
            </div>
        </div>
        <div class="card">
            <img src="assets/imgs/modeles_rasp/Raspberry-Pi-3B+.png" alt="" class="card_img">
            <div class="card_txt">
                <h3>Raspberry Pi mod&egrave;le 3B+</h3>
                <p>Le 14 mars 2018, la fondation Raspberry Pi annonce la mise à jour du Raspberry Pi 3 vers le mod&egrave;le B+. On y trouve une mise à jour du processeur Broadcom BCM2837B0 64 bit à quatre cœurs ARM Cortex-A53 cadenc&eacute; à 1,4 GHz au lieu du 1,2 GHz. la puce Cypress CYW43438 est remplac&eacute;e par une nouvelle puce CYW43455 supportant le WiFi Dual-band 802.11ac et la version 4.2 du Bluetooth.</p>
            </div>
        </div>
        <div class="card">
            <img src="assets/imgs/modeles_rasp/Raspberry-Pi-3B.png" alt="" class="card_img">
            <div class="card_txt">
                <h3>Raspberry Pi mod&egrave;le 3B</h3>
                <p>Le 29 f&eacute;vrier 2016, pour le quatri&egrave;me anniversaire de la commercialisation du premier mod&egrave;le, la fondation Raspberry Pi annonce la sortie du Raspberry Pi 3. Compar&eacute; au Pi 2, il dispose d'un processeur Broadcom BCM2837 64 bit à quatre cœurs ARM Cortex-A53 à 1,2 GHz, d'une puce Wifi 802.11n et Bluetooth 4.1 int&eacute;gr&eacute;e.</p>
            </div>
        </div>
        <div class="card">
            <img src="assets/imgs/modeles_rasp/Raspberry-Pi-3A.png" alt="" class="card_img">
            <div class="card_txt">
                <h3>Raspberry Pi mod&egrave;le 3A</h3>
                <p>Animé par un processeur quad-core ARM Cortex-A53 cadencé à 1,2 GHz, le Pi 3A est équipé de 512 Mo de RAM, offrant des performances fiables pour une variété d'applications. Doté d'un module sans fil intégré, de ports USB et d'un port HDMI, le Pi 3A offre une connectivité polyvalente, faisant de lui un choix idéal pour les projets embarqués et les applications IoT.</p>
            </div>
        </div>
        <div class="card">
            <img src="assets/imgs/modeles_rasp/Raspberry-Pi-2B.png" alt="" class="card_img">
            <div class="card_txt">
                <h3>Raspberry Pi mod&egrave;le 2B</h3>
                <p>Le 2 f&eacute;vrier 2015, la fondation Raspberry Pi annonce la sortie du Raspberry Pi 2, plus puissant, il est &eacute;quip&eacute; d'un processeur Broadcom BCM2836, quatre cœurs Cortex-A7 (ARMv7) à 900 MHz, accompagn&eacute; de 1 Go de RAM.</p>
            </div>
        </div>
        <div class="card">
            <img src="assets/imgs/modeles_rasp/1B.png" alt="" class="card_img">
            <div class="card_txt">
                <h3>Raspberry Pi mod&egrave;le 1B</h3>
                <p>Le Raspberry Pi 1B incarne le début de la révolution des nano-ordinateurs à faible coût. Alimenté par un processeur ARM1176JZF-S monocœur cadencé à 700 MHz et 512 Mo de RAM, le Pi 1B offre des performances robustes dans un format compact. Avec des ports USB, un port Ethernet et une sortie vidéo composite, cette carte a été largement adoptée pour une gamme diversifiée de projets allant de la domotique au rétrogaming.</p>
            </div>
        </div>
        <div class="card">
            <img src="assets/imgs/modeles_rasp/1A+.png" alt="" class="card_img">
            <div class="card_txt">
                <h3>Raspberry Pi mod&egrave;le 1A+</h3>
                <p>Le Raspberry Pi 1A+ est une évolution économe en énergie de la première génération. Propulsé par un processeur monocœur cadencé à 700 MHz et 512 Mo de RAM, il offre des performances fiables dans un format compact. Doté de ports USB, de connectivité audio et GPIO, le Pi 1A+ est idéal pour des projets où l'efficacité énergétique est cruciale.</p>
            </div>
        </div>
    </div>
    <footer>
        <h2 class="h2_footer">
            Raspberry Pi | Projet SNT <script>document.write(new Date().getFullYear())</script>
        </h2>
        <table class="table_footer">
            <tr class="tr_footer">
                <td class="td_footer">
                    Benjamin I.
                    <br/>
                    <button onclick="document.location.href='https://github.com/gateaublabla'" class="btn_ti_footer">
                        <img src="assets/imgs/github.png" alt="" class="img_ti_footer">
                        <p class="txt_btn_footer">GitHub</p>
                    </button>
                </td>
                <td class="td_footer">
                    Cl&eacute;ment T.S.
                    <br/>
                    <button onclick="document.location.href='https://github.com/TheClems7199'" class="btn_ti_footer">
                        <img src="assets/imgs/github.png" alt="" class="img_ti_footer">
                        <p class="txt_btn_footer">GitHub</p>
                    </button>
                </td>
            </tr>
        </table>
    </footer>
    <script src="assets/js/nav.js"></script>
</body>